app/views/visits/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :choose_doctor_category %>
    <%= collection_select(
      :user, :category_id, Category.all, :id, :speciality, { prompt: true }
    ) %>