app/views/users/_doctor_form.html.erb

SELECT COUNT(*) FROM "visits" WHERE "visits"."doc_id" = $1  [["doc_id", 4]]
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."doc_id" = $1  [["doc_id", 6]]
---
<p>Categories | Doctors | Vizits ?</p>
<button>My patients (<%= @user.requested_visits.count %>)</button>
<button><%= link_to 'My vizits', visits_path %></button>
<p>Given appointments (<%= @user.given_appointments.count %>)</p>