app/views/users/_form.html.erb

    <%= form.label :role_id %>
    <%= collection_select(
      :user, :role_id, Role.all, :id, :name, { prompt: true }
    ) %>
---
SELECT "roles".* FROM "roles"