app/views/users/_patient_form.html.erb

SELECT COUNT(*) FROM "visits" WHERE "visits"."pat_id" = $1  [["pat_id", 1]]
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."pat_id" = $1  [["pat_id", 1]]
---
<p><%= link_to 'Categories', categories_path %> | Doctors | Vizits</p>
<p>Created visits (<%= @user.created_visits.count %>)</p>
<button><%= link_to 'My vizits', visits_path %></button>
<p>Received appointments (<%= @user.received_appointments.count %>)</p>