app/views/welcome/index.html.erb

SELECT COUNT(*) FROM "users" WHERE "users"."category_id" = $1  [["category_id", 1]]
---
   <p><%= link_to category.speciality, category_path(category) %>
      (<%= category.users.count %>)