app/controllers/roles_controller.rb

  def show
    if @role.users.empty?
---
SELECT "users".* FROM "users" WHERE "users"."role_id" = $1  [["role_id", 4]]
SELECT 1 AS one FROM "users" WHERE "users"."role_id" = $1 LIMIT $2  [["role_id", 4], ["LIMIT", 1]]

    def set_role
      @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]