app/controllers/users_controller.rb

INSERT INTO "users" ("fullname", "role_id", "created_at", "updated_at", "mobile_no", "address", "email", "encrypted_password", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    if @user.save

UPDATE "users" SET "role_id" = $1, "updated_at" = $2, "encrypted_password" = $3 WHERE "users"."id" = $4  [["role_id", 5], ["updated_at", "2021-11-13 21:04:43.427533"], ["encrypted_password", "$2a$12$AMFZR6K64..QNbzS5a/xc.5Vn.ThmyolH861Tmf.KzRanA04RBEIu"], ["id", 6]]
UPDATE "users" SET "updated_at" = $1, "category_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-11-12 23:45:13.195382"], ["category_id", 2], ["id", 3]]
---
  def update
    if user_params[:password].blank?
      user_params.delete(:password)
      user_params.delete(:password_confirmation)
    end

    successfully_updated = if needs_password?(@user, user_params)
                             @user.update(user_params)
                           else
                             @user.update_without_password(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def book
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def unbook
    @user = User.find(params[:id])