app/controllers/visits_controller.rb

SELECT "visits".* FROM "visits"
---
  def index
    @visits = Visit.all

SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @visit = Visit.find(params[:id])

INSERT INTO "visits" ("date", "note", "pat_id", "doc_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2021-12-08 17:00:00"], ["note", "Crazy brain 2"], ["pat_id", 1], ["doc_id", 6], ["created_at", "2021-12-08 15:41:37.187530"], ["updated_at", "2021-12-08 15:41:37.187530"]]
INSERT INTO "visits" ("date", "note", "pat_id", "doc_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2021-12-08 21:02:00"], ["note", "Crazy brain 200"], ["pat_id", 1], ["doc_id", 6], ["created_at", "2021-12-08 21:04:23.497885"], ["updated_at", "2021-12-08 21:04:23.497885"]]
---
  def create
    @visit = current_user.created_visits.build(visit_params)
    if @visit.save

UPDATE "visits" SET "date" = $1, "updated_at" = $2 WHERE "visits"."id" = $3  [["date", "2021-12-12 10:30:00"], ["updated_at", "2021-12-07 02:31:26.303473"], ["id", 1]]
---
  def update
    if @visit.update(visit_params)

SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_visit
    @visit = Visit.find(params[:id])