app/controllers/vizits_controller.rb

SELECT "vizits".* FROM "vizits"
---
  def index
    @vizits = Vizit.all

SELECT "vizits".* FROM "vizits" WHERE "vizits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_vizit
      @vizit = Vizit.find(params[:id])