app/models/user.rb

         def self.find_first_by_auth_conditions(warden_conditions)
           conditions = warden_conditions.dup
           where(mobile_no: conditions[:mobile_no]).first
---
SELECT "users".* FROM "users" WHERE "users"."mobile_no" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["mobile_no", "380733333333"], ["LIMIT", 1]]

  def assign_role
    self.role = Role.find_by name: 'Patient' if role.nil?
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]