app/views/categories/show.html.erb

<ul class="">Doctors List:</ul>
<% @category.users.each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."category_id" = $1  [["category_id", 1]]